/**
 
Массивы!
1. Заполнить массив x целыми числами и вывести содержимое массива x на экран
2. Вывести содержимое массива x из задания 1 на экран в обратном порядке
3. Заполнить массив размером из 100 элементов случайными целыми числами
4. Вывести из массива (задание 3) все четные элементы на экран
5. Посчитать разность всех нечётных элементов массива из задания 3
6. Подсчитать количество чётных и нечётных элементов в массиве из задания 3. Количество чётных и количество нечётных вывести на экран
7. Найти и вывести на экран максимальный / минимальный элемент из задания 3
8. Найти максимальный и минимальный элемент среди чётных/нечётных элементов массива задания 3
9. Сохранить в массив типа char свою фамилию и имя (размер массива не должен превышать количество символов в фамилии пробел имени (запрещено использовать метод toCharArray класса String, однако можно использовать метод charAt() - т.е. массив char нужно заполнить посимвольно! )
10 .Реализовать считывание ФИО для задачи 9 с клавиатуры (можно использовать класс Scanner). Добавить в массив из задания 9 пробел и отчество.
11. Удалить из массива (1е задание) все элементы, кратные 3
12. Привести размер массива из задания 9 в соответствие с реальным количеством хранимых элементов
13. Отсортировать массив по возрастанию / убыванию следующими способами:
методом пузырька;
методом вставок;
методом выбора;
быстрой сортировкой.
14. Найти в массиве и вывести на экран все элементы в заданном диапазоне (например от 20 до 23)


 */
public class Tasks {

}
